In [5]:
import pandas as pd
from sqlalchemy import create_engine

In [6]:
engine = create_engine('sqlite:///:memory:')

In [7]:
data = {
    'Empleado': ['Juan', 'Ana', 'Pedro', 'Luis', 'Maria'],
    'Departamento': ['Ventas', 'Marketing', 'Ventas', 'IT', 'Marketing'],
    'Salario': [50000, 60000, 55000, 58000, 62000],
    'Años_Experiencia': [5, 7, 6, 8, 9]
}

df = pd.DataFrame(data)

In [9]:
df.to_sql('empleados', engine, index=False, if_exists='replace')

5

In [10]:
df_leido = pd.read_sql('empleados', engine)
display(df_leido)

  Empleado Departamento  Salario  Años_Experiencia
0     Juan       Ventas    50000                 5
1      Ana    Marketing    60000                 7
2    Pedro       Ventas    55000                 6
3     Luis           IT    58000                 8
4    Maria    Marketing    62000                 9

In [11]:
consulta_sql = "SELECT Empleado, Salario FROM empleados WHERE Salario > 55000"
df_consulta = pd.read_sql(consulta_sql, engine)
display(df_consulta)

  Empleado  Salario
0      Ana    60000
1     Luis    58000
2    Maria    62000

In [12]:
with engine.connect() as con:
    con.execute("UPDATE empleados SET Salario = Salario * 1.1 WHERE Departamento = 'Ventas'")

In [13]:
df_actualizado = pd.read_sql('empleados', engine)
display(df_actualizado)

  Empleado Departamento  Salario  Años_Experiencia
0     Juan       Ventas    55000                 5
1      Ana    Marketing    60000                 7
2    Pedro       Ventas    60500                 6
3     Luis           IT    58000                 8
4    Maria    Marketing    62000                 9

In [14]:
with engine.connect() as con:
    con.execute("DELETE FROM empleados WHERE Empleado = 'Pedro'")

In [15]:
df_despues_eliminacion = pd.read_sql('empleados', engine)
display(df_despues_eliminacion)

  Empleado Departamento  Salario  Años_Experiencia
0     Juan       Ventas    55000                 5
1      Ana    Marketing    60000                 7
2     Luis           IT    58000                 8
3    Maria    Marketing    62000                 9